import re

def is_bad_text(elem):
    
    pattern_list = [
        r"прода\w{1,5}" ,
        r"книга\w{1,3}" ,
        r"произведение\w{1,3}" ,
        r"чеченск\w{1,3}" ,
        r"афганск\w{1,3}" , 
        r"футбол\w{1,3}" ,
        r"спорт\w{1,3}" ,
        r"чемпион\w{1,3}" ,
        r"выходн\w{1,3}" ,
        r"автор\w{1,3}" , 
        r"терор\w{1,10}" ,
        r"фильм\w{1,3}" ,
        r"мультфильм\w{1,3}" ,
        r"монолит\w{1,3}" ,
        r"писатель\w{1,3}" ,
        r"цен\w{1,2}" ,
        r"водка\w{1,3}" ,
        r"игр\w{1,3}" ,
        r"турнир\w{1,3}" ,
        r"клан\w{1,3}" ,
        r"гильдия\w{1,3}" ,
        r"онлайн\w{1,3}" ,
        r"глава\w{1,3}" ,
        r"финанс\w{1,3}" ,
        r"модель\w{1,3}" ,
        r"продаж\w{1,3}" ,
        r"оптом\w{1,3}" ,
        r"социальных\w{1,3}"
        r"принт\w{1,3}" ,
        r"брендом\w{1,3}" ,
        r"коворкинг\w{1,3}" ,
        r"пердаки\w{1,3}" ,
        r"рождественский\w{1,3}" ,
        r"митинг\w{1,3}" ,
        r"оплат\w{1,5}" ,
        r"химчистк\w{1,3}" ,
        r"выплат\w{1,5}" , 
        r"концерт\w{1,3}" ,
        r"смартфо\w{1,3}" ,
        r"депутат\w{1,5}" ,
        r"утилиз\w{1,8}" ,
    ]

    for el in pattern_list:
        if re.search(el, elem["text"], flags= re.IGNORECASE) != None:
            return True
            
    return False

       





